tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"

# Install Brazil specific tools
brew "amazon/amazon/brazil-git-scripts"
brew "amazon/amazon/brazil-recursive-cmd-parallel"

# Install dev helper utils
brew "amazon/amazon/env-improvement"
brew "amazon/amazon/livejq"
brew "amazon/amazon/ninja-dev-sync"

tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "xz"
brew "libyaml"
brew "asdf"
brew "awscli"
brew "cairo"
brew "chezmoi"
brew "dos2unix"
brew "folly"
brew "edencommon"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "glances"
brew "gts"
brew "harfbuzz"
brew "librsvg"
brew "graphviz"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "libffi"
brew "links"
brew "neovim"
brew "nvm"
brew "openjdk"
brew "perl"
brew "plantuml"
brew "pyenv"
brew "python@3.10"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby"
brew "telnet"
brew "tmux"
brew "unison"
brew "vim"
brew "watchman"
brew "yarn"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "android-platform-tools"
cask "iterm2"
cask "react-native-debugger"
